#1. Найти значение выражени для функции "а"
a = 17 / 2 * 3 + 2;
print("Значение  17 / 2 * 3 + 2 =",a);
#2. Расставить скобки, чтобы значение не поменялось для функции "а"
a1 = (17 / 2) * 3 + 2;
print("Значение со скобками  (17 / 2) * 3 + 2 =",a1);
a2 = (17 / 2 * 3) + 2;
print("Значение со скобками  (17 / 2 * 3) + 2 =",a2);

#1. Найти значение выражени для функции "b"
b = 2 + 17 / 2 * 3;
print("\nЗначение  2 + 17 / 2 * 3 =",b);
#2. Расставить скобки, чтобы значение не поменялось для функции "b"
b1 = 2 + (17 / 2 * 3);
print("Значение  2 + (17 / 2 * 3) =",b1);
b2 = 2 + (17 / 2) * 3;
print("Значение  2 + (17 / 2) * 3 =",b2);

#1. Найти значение выражени для функции "c"
c = 19 % 4 + 15 / 2 * 3;
print("\nЗначение  19 % 4 + 15 / 2 * 3 = ", c);
#2. Расставить скобки, чтобы значение не поменялось для функции "c"
c1 = 19 % 4 + (15 / 2 * 3);
print("Значение  19 % 4 + (15 / 2 * 3) = ", c1);
c2 = (19 % 4) + (15 / 2) * 3;
print("Значение  (19 % 4) + (15 / 2) * 3 = ", c2);

#1. Найти значение выражени для функции "d"
d = (15 + 6) - 10 * 4;
print("\nЗначение  (15 + 6) - 10 * 4 = ", d);
#2. Расставить скобки, чтобы значение не поменялось для функции "d"
d1 = (15 + 6) - (10 * 4);
print("Значение  (15 + 6) - (10 * 4) = ", d1);
d2 = 15 + (6 - 10 * 4);
print("Значение  15 + (6 - 10 * 4) = ", d2);

#1. Найти значение выражени для функции "e"
e  = 17 / 2 % 2 * 3;
print("\nЗначение  17 / 2 % 2 * 3 = ", e);
#2. Расставить скобки, чтобы значение не поменялось для функции "e"
e1  = (17 / 2) % 2 * 3;
print("Значение  (17 / 2) % 2 * 3 = ", e1);
e2  = (17 / 2 % 2) * 3;
print("Значение  (17 / 2 % 2) * 3 = ", e2);